//
//  NewsArticle.swift
//  Navigation
//
//  Created by Вячеслав Терентьев on 06.04.2022.
//

import Foundation

var newsArticles: [News] = [
News(author: "Gibson представили новую модель Gary Moore Les Paul Standard.",
     description: "Это не первая гитара, которую знаменитый производитель выпустил в честь великого ирландского рок-музыканта, поэтому прежде чем начать с ней знакомиться, попробуем взглянуть на ранее выпущенные гитары..",
     image: "1",
     likes: 432,
     views: 478),
News(author: "Gary Moore Signature.",
     description: "Поскольку на гитаре не было окантовки корпуса и грифа, то для многих она смотрелась как, по сути, просто приукрашенный Studio. По большому счету, отличием от Studio был цвет и рисунок клена - они походили на знаменитый гаримуровский 59 Les Paul, известный тем, что ранее на нем играл Peter Green. Также можно отметить очень толстый гриф в духе 59 года и звукосниматели без крышек, причем нековый был развернут на 180 градусов относительно стандартного своего положения, как это было на многих личных лесполах Гари Мура. Цена у этой гитары была весьма доступной по отношению к Standard или именным гитарам того времени (Jimmy Page, Ace Frehley, Joe Perry), при том что выглядел и звучал этот инструмент намного лучше, нежели Studio. Все это, в совокупности с популярностью самого Gary Moore сделало модель бестселлером - она очень хорошо продавалась по всему миру.",
     image: "2",
     likes: 157,
     views: 356),
News(author: "59 Les Paul (Gary Moore/Peter Green)",
     description: "Во второй половине 2000-ых кому-то на Gibson пришла гениальная идея создать серию Custom Shop Collector's Choice. Идея состояла в максимально точном копировании конкретных экземпляров старых гитар. Чтобы коллекционерам подобных инструментов не надо было напрягать мозги, то все эти гитары идут под номерами от единицы и далее со всеми остановками. Номером 1 в данной серии как раз был тот самый инструмент, копировавший 59 Les Paul (Gary Moore/Peter Green), который в 2006 году был куплен коллекционером Melvyn Franks. Этот инструмент выходил в двух вариантах (сильно потрепанном и просто поблекшем). Надо ли говорить, что это один из самых желаемых Gibson из всех, что когда-либо выпускались в Custom Shop?",
     image: "3",
     likes: 160,
     views: 119),
News(author: "Gary Moore Les Paul Standard",
     description: "Нынешняя гитара Gary Moore Les Paul Standard внешне является миксом из самой первой модели и кастомшоповской Collector's Choice. С одной стороны, у нас правильные датчики с крышками, разный набор ручек. С другой стороны, опять-таки отсутствие окантовки грифа и корпуса, что удивляет на модели со словом Standard в названии. Но, разумеется, если вы фанат Gary Moore, но при этом у вас нет денег на дорогую гитару Custom Shop, то иного выхода, кроме как купить эту гитару Gary Moore Les Paul Standard, у вас не будет. Хотя можно будет просто взять Traditional похожего цвета, снять пикгуард, поменять пару ручек и перевернуть один из датчиков. Тогда ваша гитара будет еще больше похожа на Custom Shop версию внешне. Но, правда, магических слов Gary Moore в названии вашей гитары не будет. Насколько это вам важно - решать только вам самим, но какой-то Les Paul в любом случае покупать придется.оих первых модемов 5G для будущих iPhone.",
     image: "4",
     likes: 343,
     views: 167),
]

